whatis # برای نشان دادن عملکرد دستور مورد نظر استفاده می شود که کارهایی که دستور انجام می دهد را لیست می کند
whatis pwd # این دستور آدرس فایل با پوشه مورد نظر را از روت سیستم عامل نشان میدهد
whatis rmdir # با این دستور پوشه های خالی یا غیر خلی حذف می شوند
whatis find # این دستور برای جستجوی فایل ها یا پوشه ها در سطح سیستم عامل به کار می رود
whatis stat # این دستور وضعیت فعلی فایل ها پوشه ها را نشان می دهد
whatis cat # با این دستور یک فایل چاپ می شود و محتویات آن در ترمینال نمایش داده می شود و قابل یت تغییر در فایل را ندارد 
whatis wc # این دستور امکان شمارش تعداد خطوط، کلمات، کاراکترها و بایت های هر فایل داده شده یا ورودی استاندارد را به ما می دهد و آن را چاپ کنید