echo "\n****************************---------------------question3---------------------****************************\n";
echo '"mkdir test" با این دستور پوشه تست رو میسازیم'
mkdir test;
echo "------------------------------------------------"
echo '"cd test" با این دستور وارد پوشه تست می شویم'
cd test;
echo "------------------------------------------------"
echo '"touch php.php python.py js.js go.go" با این دستور چند فایل داخل پوشه تست می سازیم'
touch php.php python.py js.js go.go
echo "------------------------------------------------"
echo '"ls" این دستور فایل ها و پوشه های داخل پوشه تست رو نشان می دهد'
ls
echo "------------------------------------------------"
echo '"cd .." با این دستور به پوشه والد برمیگردیم';
cd ..
echo "------------------------------------------------"
echo '"rm -r test" با این دستور به صورت بازگشتی پوشه تست رو حذف میکنیم';
rm -r test
echo "------------------------------------------------"
echo '"ls" این دستور محتوای درون پوشه را بعد از حذف نشان می دهد';
ls

echo "\n****************************---------------------question2---------------------****************************\n";

echo "بله ترمینال کاملا به کلمات بزرگ و کوچک حساس است";

echo "\n****************************---------------------question1---------------------****************************\n";

echo '"arch" این دستور معماری سیستم رو نشون میده که 64 بیتی هستش یا 32 بیتی';
arch;
echo "------------------------------------------------"
echo '\n "uptime" این دستور زمان فعالیت کاربر فعلی را نشنان می هد';
uptime;
echo "------------------------------------------------"
echo '\n "free" این دستور اطلاعات کامل در مورد حافظه استفاده شده و بلا استفاده از رم را میگوید';
free;
echo "------------------------------------------------"
echo '\n "du" این دستور میزان حجم اشغالی فایل یا پوشه مورد نظر را در هارد میگوید ';
du Documents;
echo "------------------------------------------------"
echo '"exit" این دستور باعث خروج از اسکری\ در حال اجرا می شود';
exit